waetherData files added and dashboard export button created, and new README section
